---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFieldId.op_Equality(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFieldId)
source: html/05b7bff7-d84b-cc67-d7b9-29a7fc4c3a3c.htm
---
# Autodesk.Revit.DB.ScheduleFieldId.op_Equality Method

Determines whether two ScheduleFieldIds are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	ScheduleFieldId first,
	ScheduleFieldId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ScheduleFieldId`) - The first ScheduleFieldId.
- **second** (`Autodesk.Revit.DB.ScheduleFieldId`) - The second ScheduleFieldId.

## Returns
True if the ScheduleFieldIds are the same, otherwise false.